benjaminkravets/KW45B41Z/kw45b41zevk_beacon_freertos/framework/Platform/fwk_platform.c
/* -------------------------------------------------------------------------- */
/*                           Copyright 2021-2023 NXP                          */
/*                            All rights reserved.                            */
/*                    SPDX-License-Identifier: BSD-3-Clause                   */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                  Includes                                  */
/* -------------------------------------------------------------------------- */

#include <stdarg.h>
#include "fwk_platform.h"
#include "fwk_platform_ics.h"

/* Get some BOARD_***_DEFAULT macro values if defined in board.h for 32kHz settings */
#include "board_platform.h"

#include "FunctionLib.h"
#include "fsl_adapter_flash.h"
#include "HWParameter.h"
#include "fsl_component_timer_manager.h"
#include "fsl_os_abstraction.h"
#include "fsl_ltc.h"
#include "fsl_adapter_rpmsg.h"
#include "fsl_ccm32k.h"
#include "fsl_spc.h"

#if defined(gMWS_Enabled_d) && (gMWS_Enabled_d > 0)
#include "fwk_platform_mws.h"
#endif

#if defined(HDI_MODE) && (HDI_MODE == 1)
#include "fsl_port.h"
#include "hdi.h"
#endif

#include "fwk_debug.h"

#include "mcmgr_imu_internal.h"

/* -------------------------------------------------------------------------- */
/*                               Private macros                               */
/* -------------------------------------------------------------------------- */

/*! @brief XTAL 32Mhz clock source start up timeout */
#ifndef FWK_PLATFORM_XTAL32M_STARTUP_TIMEOUT
#define FWK_PLATFORM_XTAL32M_STARTUP_TIMEOUT 1000000
#endif /* FWK_PLATFORM_XTAL32M_STARTUP_TIMEOUT */

/*! @brief Default load capacitance config for 32KHz crystal,
      can be overidden from board.h,
      user shall define this flag in board.h file to set an other default value
      Values must be adjust to minimize the jitter on the crystal. This is to avoid
      a shift of 31.25us on the link layer timebase in NBU.
*/
#if !defined(BOARD_32KHZ_XTAL_CLOAD_DEFAULT)
#define BOARD_32KHZ_XTAL_CLOAD_DEFAULT 8U
#endif

/*! @brief Default coarse adjustement config for 32KHz crystal,
      can be overidden from board.h,
      user shall define this flag in board.h file to set an other default value
      Values must be adjusted depending the equivalent series resistance (ESR) of the crystal on the board
*/
#if !defined(BOARD_32KHZ_XTAL_COARSE_ADJ_DEFAULT)
#define BOARD_32KHZ_XTAL_COARSE_ADJ_DEFAULT 1
#endif

#if !defined(BOARD_32KHZ_XTAL_CAPACITANCE_MAX_VALUE)
#define BOARD_32KHZ_XTAL_CAPACITANCE_MAX_VALUE (uint8_t) kCCM32K_OscExtal30pFCap
#endif

/*! @brief Delay from the 32MHz wake up of the LL to wake up the radio domain in number of 30.5us period */
#if !defined(BOARD_RADIO_DOMAIN_WAKE_UP_DELAY)
#define BOARD_RADIO_DOMAIN_WAKE_UP_DELAY 0x0U
#endif

#if !defined(FSL_FEATURE_TSTMR_CLOCK_FREQUENCY_1MHZ) || !FSL_FEATURE_TSTMR_CLOCK_FREQUENCY_1MHZ
#warning "Warning: TSTMR freq is not 1MHz !"
#endif

/*! @brief XTAL 32Khz clock source start up timeout */
#ifndef FWK_PLATFORM_XTAL32K_STARTUP_TIMEOUT
#define FWK_PLATFORM_XTAL32K_STARTUP_TIMEOUT 10000000
#endif /* FWK_PLATFORM_XTAL32K_STARTUP_TIMEOUT */

/*! @brief Remote active request timeout */
#ifndef FWK_PLATFORM_ACTIVE_REQ_TIMEOUT_US
#define FWK_PLATFORM_ACTIVE_REQ_TIMEOUT_US 10000U
#endif /* FWK_PLATFORM_ACTIVE_REQ_TIMEOUT_US */

/* Raise error with status update , shift previous status by 4 bits and OR with new error code.
 * the returned status will be negative */
#define RAISE_ERROR(__st, __error_code) -(int)((uint32_t)(((uint32_t)(__st) << 4) | (uint32_t)(__error_code)));

/* -------------------------------------------------------------------------- */
/*                         Private memory declarations                        */
/* -------------------------------------------------------------------------- */

extern const scg_sys_clk_config_t g_sysClkConfig_SOC_ClockLowPower;

const scg_sys_clk_config_t g_sysClkConfig_SOC_ClockLowPower = {
    .divSlow = (uint32_t)kSCG_SysClkDivBy3,  /* Slow Clock Divider: divided by 3 */
    .divBus  = (uint32_t)kSCG_SysClkDivBy1,  /* Bus Clock Divider: divided by 1 */
    .divCore = (uint32_t)kSCG_SysClkDivBy16, /* Core Clock Divider: divided by 16 */
    .src     = (uint32_t)kSCG_SysClkSrcFirc, /* Fast IRC is selected as System Clock Source */
};

static volatile int timer_manager_initialized = 0;

static int nbu_init = 0;

/****************** LOWPOWER ***********************/
/* Number of request for CM3 to remain active */
static int8_t active_request_nb = 0;

extern PLATFORM_ErrorCallback_t pfPlatformErrorCallback;
PLATFORM_ErrorCallback_t        pfPlatformErrorCallback = (void *)0;

/* -------------------------------------------------------------------------- */
/*                              Public functions                              */
/* -------------------------------------------------------------------------- */

#if defined(HDI_MODE) && (HDI_MODE == 1)
void BOARD_InitPinsRFUART(void)
{
    /* RFUART_SIN */
    PORT_SetPinMux(PORTD, 1, kPORT_MuxAlt8);
    /* RFUART_SOUT */
    PORT_SetPinMux(PORTD, 2, kPORT_MuxAlt8);
}

void BOARD_InitPinsSPI0(void)
{
    /* Warning: current SPI0 pinmux can interfere with LPUART0 */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* SPI0_PCS0 */
    PORT_SetPinMux(PORTA, 16, kPORT_MuxAlt2);
    /* SPI0 SIN */
    PORT_SetPinMux(PORTA, 17, kPORT_MuxAlt2);
    /* SPI0 SOUT */
    PORT_SetPinMux(PORTA, 18, kPORT_MuxAlt2);
    /* SPI0 SCK */
    PORT_SetPinMux(PORTA, 19, kPORT_MuxAlt2);
}

static void BOARD_InitPinsRF(void)
{
    CLOCK_EnableClock(kCLOCK_PortA);
    CLOCK_EnableClock(kCLOCK_PortB);
    CLOCK_EnableClock(kCLOCK_PortC);

    /* ipp_do_rf_fpga [0..5] */
    // PORT_SetPinMux(PORTA, 16U, kPORT_MuxAlt8); // pinmux bypassed
    // PORT_SetPinMux(PORTA, 18U, kPORT_MuxAlt8);
    // PORT_SetPinMux(PORTA, 19U, kPORT_MuxAlt8);
    // PORT_SetPinMux(PORTD, 1U, kPORT_MuxAlt9);
    // PORT_SetPinMux(PORTD, 2U, kPORT_MuxAlt9);
    // PORT_SetPinMux(PORTD, 3U, kPORT_MuxAlt9);

    /* DTEST [0..12] */
    PORT_SetPinMux(PORTC, 0U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 5U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTC, 6U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 0U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 1U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 2U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 3U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 4U, kPORT_MuxAlt8);
    PORT_SetPinMux(PORTB, 5U, kPORT_MuxAlt8);

    /* PTD3 is used for Phy switch */
    // PORT_SetPinMux(PORTD, 3U, kPORT_MuxAsGpio);
}
#endif

