benjaminkravets/KW45B41Z/kw45b41zevk_beacon_freertos/framework/Platform/fwk_platform.c
int PLATFORM_IsNbuStarted(void)
{
    return nbu_init;
}
int PLATFORM_InitNbu(void)
{
    int status = 0;

    if (nbu_init == 0)
    {
        uint32_t rfmc_ctrl;
        int      cnt = 0;

        /* Initialize a memory zone of the shared memory that will be used to transmit a message later */
        extern uint32_t m_lowpower_flag_start[];
        *(volatile unsigned int *)(m_lowpower_flag_start) = (uint32_t)0U;

        rfmc_ctrl = RFMC->RF2P4GHZ_CTRL;

        /* Enables BLE Power Controller on NBU side AND sets LP mode to DeepSleep */
        rfmc_ctrl &= ~(RFMC_RF2P4GHZ_CTRL_LP_WKUP_DLY_MASK | RFMC_RF2P4GHZ_CTRL_LP_MODE_MASK);
        rfmc_ctrl |=
            (RFMC_RF2P4GHZ_CTRL_LP_MODE(0x3) | RFMC_RF2P4GHZ_CTRL_LP_WKUP_DLY(BOARD_RADIO_DOMAIN_WAKE_UP_DELAY) |
             RFMC_RF2P4GHZ_CTRL_BLE_LP_EN(0x1U) | RFMC_RF2P4GHZ_CTRL_SFA_TRIG_EN(0x7U));

        RFMC->RF2P4GHZ_CTRL = rfmc_ctrl;
        RFMC->RF2P4GHZ_TIMER |= RFMC_RF2P4GHZ_TIMER_TIM_EN(0x1U);

        /* Enabling BLE Power Controller (BLE_LP_EN) will automatically start the XTAL
         * According to RM, we need to wait for the XTAL to be ready before accessing
         * Radio domain ressources.
         * Here, we make sure the XTAL is ready before releasing the CM3 from reset
         * it will prevent any access issue when the CM3 is starting up.
         * CM3 is released in HAL_RpmsgMcmgrInit */
        BOARD_DBGLPIOSET(2, 1);
        while ((cnt++ < FWK_PLATFORM_XTAL32M_STARTUP_TIMEOUT) && ((RFMC->XO_STAT & RFMC_XO_STAT_XTAL_RDY_MASK) == 0U))
        {
            BOARD_DBGLPIOSET(2, 0);
            __ASM("NOP");
            BOARD_DBGLPIOSET(2, 1);
        }
        BOARD_DBGLPIOSET(2, 0);

        if (cnt > FWK_PLATFORM_XTAL32M_STARTUP_TIMEOUT)
        {
            status = RAISE_ERROR(0, 1);
        }
        else
        {
            DBG_NBU_GPIOD_ACCESS();

            /* nbu initialization completed */
            nbu_init = 1;
        }
    }
    else
    {
        /* Initialization already done */
        status = 1;
    }

    return status;
}

int PLATFORM_InitMulticore(void)
{
    int                status = 0;
    hal_rpmsg_status_t rpmsg_status;

    /* Start CM3 core and Initializes the RPMSG adapter module for dual core communication */
    rpmsg_status = HAL_RpmsgMcmgrInit();
    if (rpmsg_status != kStatus_HAL_RpmsgSuccess)
    {
        status = RAISE_ERROR(rpmsg_status, 1);
        assert(0);
    }

    return status;
}

void PLATFORM_LoadHwParams(void)
{
    uint8_t               xtal_32m_trim;
    hardwareParameters_t *pHWParams = NULL;
    uint32_t              status;

    /* Load the HW parameters from Flash to RAM */
    status = NV_ReadHWParameters(&pHWParams);
    if ((status == 0U) && (pHWParams->xtalTrim != 0xFFU))
    {
        /* There is an existing trim value */
        xtal_32m_trim = pHWParams->xtalTrim;
        /* Set value to RFMC */
        PLATFORM_SetXtal32MhzTrim(xtal_32m_trim, FALSE);
    }
}

/* get 4 words of information that uniquely identifies the MCU */
void PLATFORM_GetMCUUid(uint8_t *aOutUid16B, uint8_t *pOutLen)
{
    uint32_t uid[4] = {0};

    /* Get the MCU uid */
    uid[0] = MSCM->UID[0];
    uid[1] = MSCM->UID[1];
    uid[2] = MSCM->UID[2];
    uid[3] = MSCM->UID[3];

    FLib_MemCpy(aOutUid16B, (uint8_t *)uid, sizeof(uid));
    /* Get the uid length */
    *pOutLen = (uint8_t)sizeof(uid);

    return;
}

int PLATFORM_InitFro32K(void)
{
    /* Enable the fro32k and select it as 32k clock source and disable osc32k
     * The NBU firmware embeds a module capable of trimming the fro32k to get it as close as possible from 32768Hz
     * */
    CCM32K_Enable32kFro(CCM32K, true);
    CCM32K_SelectClockSource(CCM32K, kCCM32K_ClockSourceSelectFro32k);
    while ((CCM32K_GetStatusFlag(CCM32K) & (uint32_t)kCCM32K_32kFroActiveStatusFlag) == 0U)
    {
        /* wait for the switch to fro32k to be effective before disabling osc32k */
    }

    /* Turning off the XTAL32K will indicate to the NBU that the 32K source is from FRO32K */
    CCM32K_Set32kOscConfig(CCM32K, kCCM32K_Disable32kHzCrystalOsc, NULL);

    return 0;
}

int PLATFORM_InitOsc32K(void)
{
    int      status;
    uint32_t osc32k_ctrl;
    uint8_t  xtalCap32K = BOARD_32KHZ_XTAL_CLOAD_DEFAULT;

    status = PLATFORM_GetOscCap32KValue(&xtalCap32K);

    osc32k_ctrl = CCM32K->OSC32K_CTRL;

    /* Clear OSC32K configuration */
    osc32k_ctrl &= ~(CCM32K_OSC32K_CTRL_OSC_EN_MASK | CCM32K_OSC32K_CTRL_SOX_EN_MASK |
                     CCM32K_OSC32K_CTRL_CAP_SEL_EN_MASK | CCM32K_OSC32K_CTRL_XTAL_CAP_SEL_MASK |
                     CCM32K_OSC32K_CTRL_EXTAL_CAP_SEL_MASK | CCM32K_OSC32K_CTRL_COARSE_AMP_GAIN_MASK);

    /* Set Cload and trimming config to achieve 32768 Hz
     * Tests showed about 20 - 70 ppm with this config on EVK boards */
    osc32k_ctrl |= (CCM32K_OSC32K_CTRL_XTAL_CAP_SEL(xtalCap32K) | CCM32K_OSC32K_CTRL_EXTAL_CAP_SEL(xtalCap32K));

    /* Set amplifier gain adjustement to select external crystal ESR range */
    osc32k_ctrl &= ~(CCM32K_OSC32K_CTRL_COARSE_AMP_GAIN_MASK);
    osc32k_ctrl |= CCM32K_OSC32K_CTRL_COARSE_AMP_GAIN(BOARD_32KHZ_XTAL_COARSE_ADJ_DEFAULT);

    /* Enable crystal load capacitance and SOX mode */
    osc32k_ctrl |= CCM32K_OSC32K_CTRL_CAP_SEL_EN(0x1U) | CCM32K_OSC32K_CTRL_SOX_EN(0x1U);

    CCM32K->OSC32K_CTRL = osc32k_ctrl;

    /* Enable OSC32K */
    osc32k_ctrl |= CCM32K_OSC32K_CTRL_OSC_EN(0x1U);
    CCM32K->OSC32K_CTRL = osc32k_ctrl;

    return status;
}

int PLATFORM_GetOscCap32KValue(uint8_t *xtalCap32K)
{
    hardwareParameters_t *pHWParams = NULL;
    int                   status;

    status = (int)NV_ReadHWParameters(&pHWParams);

    if ((status == 0) && (pHWParams->xtalCap32K != 0xFFU))
    {
        uint32_t regPrimask;
        regPrimask  = DisableGlobalIRQ();
        *xtalCap32K = pHWParams->xtalCap32K;
        EnableGlobalIRQ(regPrimask);
    }
    else
    {
        *xtalCap32K = BOARD_32KHZ_XTAL_CLOAD_DEFAULT;
    }
    /* If the HWParameter are not set it will keep the value chosen by default so do nothing here */
    return status;
}

int PLATFORM_SetOscCap32KValue(uint8_t xtalCap32K)
{
    hardwareParameters_t *pHWParams = NULL;
    int                   status;
    ccm32k_osc_config_t   osc32k_config;

    do
    {
        uint32_t regPrimask;
        if (xtalCap32K > BOARD_32KHZ_XTAL_CAPACITANCE_MAX_VALUE)
        {
            status = -1;
            break;
        }

        status = (int)NV_ReadHWParameters(&pHWParams);
        if (status != 0)
        {
            break;
        }

        regPrimask            = DisableGlobalIRQ();
        pHWParams->xtalCap32K = xtalCap32K;
        (void)NV_WriteHWParameters();
        EnableGlobalIRQ(regPrimask);

        osc32k_config.enableInternalCapBank = true;
        osc32k_config.coarseAdjustment      = (ccm32k_osc_coarse_adjustment_value_t)BOARD_32KHZ_XTAL_COARSE_ADJ_DEFAULT;

        osc32k_config.extalCap = (ccm32k_osc_extal_cap_t)xtalCap32K;
        osc32k_config.xtalCap  = (ccm32k_osc_xtal_cap_t)xtalCap32K;

        CCM32K_Set32kOscConfig(CCM32K, kCCM32K_Enable32kHzCrystalOsc, &osc32k_config);

    } while (false);

